<template>
    <div
        @click="showAnswer = !showAnswer"
        class="bg-[#ECF0FF] border border-[#D2D9F1] rounded-xl transition duration-500 p-4 lg:p-8 active">
        <button
            :id="test"
            :aria-expanded="showAnswer"
            :aria-controls="test"
            class="inline-flex items-center text-left font-medium leading-8 lg:text-xl w-full transition duration-500">
            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                <path
                    d="M12.176 13.1318L15.833 9.47483C15.8996 9.40174 15.9802 9.34275 16.0699 9.30134C16.1597 9.25994 16.2568 9.23697 16.3556 9.23378C16.4544 9.2306 16.5529 9.24727 16.6451 9.2828C16.7374 9.31834 16.8215 9.37202 16.8927 9.44067C16.9638 9.50932 17.0204 9.59155 17.0592 9.68247C17.098 9.7734 17.1181 9.87118 17.1184 9.97003C17.1188 10.0689 17.0992 10.1668 17.061 10.258C17.0228 10.3491 16.9667 10.4317 16.896 10.5008L16.878 10.5188L12.699 14.6988C12.5605 14.8374 12.3725 14.9152 12.1765 14.9152C11.9806 14.9152 11.7926 14.8374 11.654 14.6988L7.47505 10.5198C7.40525 10.4524 7.34942 10.3719 7.31074 10.2829C7.27206 10.1938 7.25129 10.0981 7.24962 10.0011C7.24795 9.90402 7.26541 9.8076 7.301 9.71731C7.33659 9.62702 7.38961 9.54462 7.45705 9.47483C7.52448 9.40503 7.605 9.3492 7.69401 9.31052C7.78302 9.27184 7.87878 9.25107 7.97582 9.2494C8.07286 9.24773 8.16927 9.26519 8.25956 9.30078C8.34985 9.33637 8.43225 9.38939 8.50205 9.45683L8.52005 9.47483L12.176 13.1318Z"
                    fill="#3275F2" stroke="#3275F2" stroke-width="0.5" />
            </svg>
            <h5 class="pr-4 text-start">
                چرا آقای ساختمان انجام کارها را راحت‌تر می‌کند؟
            </h5>
        </button>
        <div
        :id="test"
         :class="[ showAnswer ? 'grid-rows-[1fr] opacity-100' : 'grid-rows-[0fr] opacity-0']"
         class="grid w-full overflow-hidden duration-200 transition-all">
            <p class="lg:text-base text-[#807CA4] overflow-hidden">
                با آقای ساختمان می توانید با معتبر ترین مهندسین و متخصصین ساختمانی ارتباط بگیرید و اقلام مورد نیاز خود
                از قبیل مصالح ساختمانی و… را در سریعترین زمان ممکن و به راحتی خرید و فروش کنید.      
                همچنین برای عزیزانی که به دنبال خرید و فروش، اجاره و رهن یا پیش خرید ملک هستند نیز بستری را فراهم کرده
                ایم تا به راحتی فایل های خود را به اشتراک بگذارند و تنها در چند دقیقه چندین فایل را بررسی کنند.
                بنابراین، در خانه بنشینید و با آقای ساختمان در سریعترین زمان ممکن ملک مناسب خود را پیدا کنید و به انجام
                معامله بپردازید!
            </p>
        </div>
    </div>
</template>
<script setup>
const showAnswer = ref(false);
defineProps(['test'])
</script>